test/performance/benchmarks/real-traffic-test/results/kube-manager/10_seconds-10_interfering/2026-02-23_20-35-18/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: false
Sources of Interference: 10
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.986s, 59.98s, 6.374ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.9ms, 125.069ms, 6.451ms, 21.057ms, 659.726ms, 3.206s, 4.869s
Bytes In      [total, mean]                     29133469, 9711.16
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.1ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.9ms, 75.609ms, 6.172ms, 14.784ms, 39.868ms, 2.325s, 2.653s
Bytes In      [total, mean]                     2914195, 9713.98
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 6.116ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.218ms, 72.092ms, 6.71ms, 14.694ms, 57.051ms, 2.193s, 2.695s
Bytes In      [total, mean]                     2911528, 9705.09
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.804s, 59.799s, 5.41ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.165ms, 82.67ms, 6.595ms, 38.273ms, 252.835ms, 2.281s, 2.754s
Bytes In      [total, mean]                     2912402, 9708.01
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.726ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.124ms, 79.64ms, 6.503ms, 30.179ms, 259.012ms, 2.231s, 2.768s
Bytes In      [total, mean]                     2913312, 9711.04
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.422ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.126ms, 125.066ms, 6.404ms, 14.288ms, 757.166ms, 3.174s, 3.608s
Bytes In      [total, mean]                     2913646, 9712.15
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.799s, 6.077ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.953ms, 134.387ms, 6.164ms, 12.47ms, 946.121ms, 3.345s, 3.729s
Bytes In      [total, mean]                     2914098, 9713.66
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.903ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.109ms, 204.848ms, 6.581ms, 16.933ms, 1.893s, 4.233s, 4.688s
Bytes In      [total, mean]                     2913133, 9710.44
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.799s, 5.643ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.124ms, 128.038ms, 6.328ms, 13.806ms, 794.584ms, 3.232s, 3.644s
Bytes In      [total, mean]                     2913655, 9712.18
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.129ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.129ms, 137.804ms, 6.6ms, 55.15ms, 903.892ms, 3.276s, 3.789s
Bytes In      [total, mean]                     2913576, 9711.92
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.374ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.905ms, 210.539ms, 6.418ms, 17.314ms, 1.969s, 4.343s, 4.869s
Bytes In      [total, mean]                     2913924, 9713.08
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: